{
  "Scenarios": [{
		"id": 0,
		"scenarioText": "The Psyche Mission is part of NASA's Discovery Program where the aim of the mission is to discover the origins of a metal-rich asteroid through scientific observations done completed by a spacecraft orbiter. The orbiter launched on October 13, 2023 where it will spend the next six years travelling to the asteroid. It is your job as the player to make sure that the orbiter makes the long jounery on time and in one piece. The orbiter will encounter incidents which the player must overcome by making the correct decisions for each scenario.",
		"solution1Text": null,
		"solution2Text": null,
		"solution3Text": null,
		"solution1Id": null,
		"solution2Id": null,
		"solution3Id": null
	},
	{
		"id": 1,
		"scenarioText": "On approach to Mars for the gravity assist it was discovered that the flight path was miscalculated due to the delay of the launch date. Quick adjustments are needed to correct the flight path, however, the cold gas thursters are not firing to orient the orbiter.",
		"solution1Text": "Bypass PPU1 and send command through PPU2",
		"solution2Text": "Use RWA instead",
		"solution3Text": "Resend command on same data line",
		"solution1Id": 1,
		"solution2Id": 2,
		"solution3Id": 3
	},
	{
		"id": 2,
		"scenarioText": "On approach to the asteroid it is discovered that gravitational readings are low for the designated orbit.",
		"solution1Text": "Make orbit smaller",
		"solution2Text": "Maintain previously calculated orbit",
		"solution3Text": "Make orbit larger",
		"solution1Id": 4,
		"solution2Id": 5,
		"solution3Id": 6
	},
	{
		"id": 3,
		"scenarioText": "The commands sent to the orbiter were not executed properly and deviations have been recorded.",
		"solution1Text": "Replace PCE",
		"solution2Text": "Restart PCE",
		"solution3Text": "Resend commands",
		"solution1Id": 7,
		"solution2Id": 8,
		"solution3Id": 9
	},
	{
		"id": 4,
		"scenarioText": "Orbiter recieved last commands 2 weeks ago and will enter the solar convergance in another 2 weeks. The orbiter is now apporaching and will enter a solar conjunction in two weeks. The last commands sent to the orbiter were sent two weeks ago. Are any adjustments needed?",
		"solution1Text": "Upload new commands early",
		"solution2Text": "Send command to enter safemode for duration of solar conjunction",
		"solution3Text": "Continue with previous commands",
		"solution1Id": 10,
		"solution2Id": 11,
		"solution3Id": 12
	},
	{
		"id": 5,
		"scenarioText": "On a routine communication from the orbiter to the ground it has been noted that the charge in the battery is slightly lower than expected for this point in the mission.",
		"solution1Text": "Recalibrate Star-tracker",
		"solution2Text": "Use thrusters to adjust solar panels",
		"solution3Text": "Disregard warning",
		"solution1Id": 13,
		"solution2Id": 14,
		"solution3Id": 15
	},
	{
		"id": 6,
		"scenarioText": "The Psyche Compute Element has determined that the spacecraft has deviated from the flight path trajectory. Further data suggests that the thrusters have been operating within the mission's paramters.",
		"solution1Text": "Enter CG based safe mode",
		"solution2Text": "Adjust attitude with main thrusters",
		"solution3Text": "Enter RWA based safe mode",
		"solution1Id": 16,
		"solution2Id": 17,
		"solution3Id": 18
	}],
  	"Solutions": [{
		"id": 1,
		"solutionText": "The main propulsion unit that controls the cold gas thrusters was malfunctioning so have been sent to the thrusters by the secondary unit."
	},
	{
		"id": 2,
		"solutionText": "The reaction wheels are slower than the cold gas thrusters at maneuvering so the adjustments are much less effecient."
	},
	{
		"id": 3,
		"solutionText": "The thrusters are still not working the ground is being notified and a solution will be sent."
	},
	{
		"id": 4,
		"solutionText": "A smaller orbit increases the gravatational readings to allow the data to be of use in the reasearch of the asteroid."
	},
	{
		"id": 5,
		"solutionText": "The gravatational readings from the previously calculated orbit are too low and inadequate for use."
	},
	{
		"id": 6,
		"solutionText": "Enlarging the orbit reduces the readings to an immesearuable scale."
	},
	{
		"id": 7,
		"solutionText": "The PDA replaces the main Psyche Computer Element with the backup and reboots the whole system. Then the commands are re-sent to ensure the orbiter continues on the correct path."
	},
	{
		"id": 8,
		"solutionText": "The command executes properly this time, however the reason this error occured is still unknown and may happen again."
	},
	{
		"id": 9,
		"solutionText": "The command was still not executed properly. There seems be be an underlying issue with the compute element itself."
	},
	{
		"id": 10,
		"solutionText": "New commands had to be sent early otherwise they would not have been recieved by the orbiter and would have entered safe mode for the entirety of the conjunction."
	},
	{
		"id": 11,
		"solutionText": "The command to enter safemode for the duartion of the conjunction then continue previous commands after the conjunction ends."
	},
	{
		"id": 12,
		"solutionText": "After the Earth passes from behind the sun the ground has recieved a signal from the orbiter suggesting that it has been in safe mode. Upon further analysis it was shown that the orbiter entered afemode once it enteres the conjunction and lost conatct with the ground without recieveing new commands."
	},
	{
		"id": 13,
		"solutionText": "While checking the system logs it was found that the star tracker was off target by 5 degrees. This caused the solar panels to be misaligned and was therefore not reciveing energy from the sun as effieciently. After the star tracker was calibrated the solar panels were readjusted to effieciently charge the battery."
	},
	{
		"id": 14,
		"solutionText": "Using the thrusters to adjust the panels is highly ineffiecient due to not being able to thrust while charging the battery."
	},
	{
		"id": 15,
		"solutionText": "Weeks later the orbiter entered safe mode to notify the ground that the battery has fallen below mission parameters and is forced to fix the problem at hand."
	},
	{
		"id": 16,
		"solutionText": "The thrusters were operating correctly therefore the deviation was casued by a fault in the reaction wheel assembly that controlled the minor adjustements to the orbiters attitude. The orbiter has switched to cold gas based safe mode to notify the ground of the fault and prepare for new commands to be sent to correct the flight path."
	},
	{
		"id": 17,
		"solutionText": "While the trajectory was corrected using the main thrusters the underlying issue has not been resolved and further corrections may be needed in the future."
	},
	{
		"id": 18,
		"solutionText": "The orbiter has failed to orient itself in the correct direction to contact the ground. The orbiter has changed safe modes in order to notify the ground of the faults."
	}]
}